src/Reports/Scan_ЕженедельныйОтчет/Scan_ЕженедельныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Scan_ЕженедельныйОтчет</name>
</mdclass:Report>

src/InformationRegisters/Scan_PlanForWeek/Scan_PlanForWeek.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_PlanForWeek</name>
  <resources>
    <name>SLA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>MZ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>MS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BusChassis</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Engines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Buses</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BodybuiltUnits</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Jenty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>TruckOnTruckDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>JockeyTransportation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>GenSetsTransportation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVehicles</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVisits</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AcceptanceHandoverDemoTestRent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AdministrationOfVehiclesSales</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КорректировкаИнформацииПоЗаявкам/Scan_КорректировкаИнформацииПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КорректировкаИнформацииПоЗаявкам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаявкаПеревозчику</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
    </type>
  </resources>
  <resources>
    <name>СтатусИзделия</name>
    <type>
      <types>EnumRef.Scan_СтатусыИзделий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставкиПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </resources>
  <resources>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </resources>
  <resources>
    <name>ПриемВВыходныеДни</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонечныйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаДействие</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GuidСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДетализацияПлановыхДанных/Scan_ДетализацияПлановыхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДетализацияПлановыхДанных</name>
  <resources>
    <name>SLA</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MZ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MS</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BusChassis</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Engines</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Buses</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BodybuiltUnits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Jenty</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>TruckOnTruckDelivery</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>JockeyTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>GenSetsTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVehicles</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVisits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AcceptanceHandoverDemoTestRent</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AdministrationOfVehiclesSales</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ОбъектыКлючевыхДат/Scan_ОбъектыКлючевыхДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ОбъектыКлючевыхДат</name>
  <enumValues>
    <name>ЗаказНаЗавод</name>
  </enumValues>
  <enumValues>
    <name>Изделие</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЗакупку</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_КлючевыеДаты/Scan_КлючевыеДаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_КлючевыеДаты</name>
  <enumValues>
    <name>AAD</name>
    <comment>Actual Audit Date	Фактическая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>ADD</name>
    <comment>Actual Delivery Date	Фактическая дата прихода по первому адресу доставки, указанному в заказе, который отправлен на завод-изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>ADDLBB</name>
    <comment>Actual Delivery Date Local BB	Фактическая дата прихода шасси на площадку кузовостроителя</comment>
  </enumValues>
  <enumValues>
    <name>AN</name>
    <comment>Audit Notification	Дата поступления вызова на аудит от кузовостроителя. </comment>
  </enumValues>
  <enumValues>
    <name>CDD</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. </comment>
  </enumValues>
  <enumValues>
    <name>CDD2</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. Отклонение от даты CDD</comment>
  </enumValues>
  <enumValues>
    <name>CDDX</name>
    <comment>Кол-во дней до даты CDD для отправки напоминания дилерам</comment>
  </enumValues>
  <enumValues>
    <name>CDDПоставщик</name>
    <comment>Confirm Delivery Date of contractor	Подтвержденная поставщиком дата прихода по первому адресу доставки. Дата из файла от поставщика</comment>
  </enumValues>
  <enumValues>
    <name>CRD</name>
    <comment>Confirm Ready Date	Плановая дата выхода продукта с конвейера на заводе. </comment>
  </enumValues>
  <enumValues>
    <name>DCD</name>
    <comment>Desired Customer Date Дата, когда клиент хочет получить готовый автомобиль у дилера</comment>
  </enumValues>
  <enumValues>
    <name>DD</name>
  </enumValues>
  <enumValues>
    <name>DD2</name>
  </enumValues>
  <enumValues>
    <name>DDD</name>
    <comment>Desired Delivery Date Желаемый срок поставки по первому адресу доставки, указанному в заказе на завод изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>DDS</name>
    <comment>DD of SOP</comment>
  </enumValues>
  <enumValues>
    <name>EDD</name>
    <comment>Estimated Delivery Date	Предварительная дата готовности ПК ТС у кузовостроителя </comment>
  </enumValues>
  <enumValues>
    <name>ETA</name>
    <comment>Estimated Time of Arrival	Ожидаемая дата прихода транспортного средства на склад отгрузки</comment>
  </enumValues>
  <enumValues>
    <name>FinishDate</name>
    <comment>Finish Date	Это дата физической готовности продукта на заводе.</comment>
  </enumValues>
  <enumValues>
    <name>PAD</name>
    <comment>Planned Audit Date	Планируемая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>PDD</name>
    <comment>Preliminary Delivery Date	Предварительная дата прихода по первому адресу доставки</comment>
  </enumValues>
  <enumValues>
    <name>PODOD</name>
    <comment>Date of Delivery Дата поставки (дата, указываемая в заказе на закупку на надстройку/оборудование)</comment>
  </enumValues>
  <enumValues>
    <name>PTSD</name>
    <comment>PTS Date	Дата выписки ПТС на ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>RDB</name>
  </enumValues>
  <enumValues>
    <name>RFT</name>
    <comment>Ready for Transfer	Фактическая дата готовности ПК ТС для передачи SRU. </comment>
  </enumValues>
  <enumValues>
    <name>SDDate</name>
    <comment>Specification Definite Date Последний день, когда спецификация заказа может быть изменена. Дата доступна в FAIN\Rain</comment>
  </enumValues>
  <enumValues>
    <name>SoW</name>
    <comment>Start of Warranty	Дата начала гарантии Скания. В SPII это Delivery Date</comment>
  </enumValues>
  <enumValues>
    <name>WED</name>
    <comment>Warranty End Date	Дата окончания гарантии</comment>
  </enumValues>
  <enumValues>
    <name>БроньДилера</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийРезервДилера</name>
  </enumValues>
  <enumValues>
    <name>ДатаБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>ДатаИнвойса</name>
    <comment>14434</comment>
  </enumValues>
  <enumValues>
    <name>ДатаОтгрузкиСЗаводаПриEXW</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиБУИзделияДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиИзделияДилеру</name>
    <comment>Дата фактической передачи продукта дилеру </comment>
  </enumValues>
  <enumValues>
    <name>ДатаПокупкиБУИзделия</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияБУНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИнвойса1С</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиИзделия</name>
    <comment>Дата документа продажи продукта дилеру в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиКлиенту</name>
    <comment>Дата документа продажи продукта клиенту в SDMS (в SOWA.net – это дата поставки), либо дата документа продажи продукта клиенту в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиПродуктаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаСписания</name>
  </enumValues>
  <enumValues>
    <name>Квота</name>
  </enumValues>
  <enumValues>
    <name>ПортСПБ</name>
    <comment>ПортСПБ</comment>
  </enumValues>
  <enumValues>
    <name>ПродуктВАрхиве</name>
    <comment>Техническая дата, означающая проданный продукт, убывший из учета</comment>
  </enumValues>
</mdclass:Enum>

src/Reports/Scan_ЕженедельныйОтчет/Forms/ФормаОтчета/Module.bsl
//rarus tenkam 28.12.2017 mantis 9066 +++
&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			 Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ТекущийГод") Тогда
				ТекЭлемент.Значение = Год(ТекущаяДата());	
			КонецЕсли;
			
			 Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("НомерНедели") Тогда
				ТекЭлемент.Значение = НеделяГода(ТекущаяДата());	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ТекущийГод") Тогда
				ТекЭлемент.Значение = Год(ТекущаяДата());	
			КонецЕсли;
			
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("НомерНедели") Тогда
				ТекЭлемент.Значение = НеделяГода(ТекущаяДата());	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

&НаСервере 
Процедура СформироватьОтчетНаСервере(ТаблДок)
	
	ТекНомерНедели = 0;
	ТекГод = Год(ТекущаяДата());	// rarus tenkam 14.01.2021 mantis 17098 +
	
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("НомерНедели") Тогда
				ТекНомерНедели = ТекЭлемент.Значение;	
			КонецЕсли;
			// rarus tenkam 14.01.2021 mantis 17098 +++
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ТекущийГод") Тогда
				ТекГод = ТекЭлемент.Значение;	
			КонецЕсли;			
			// rarus tenkam 14.01.2021 mantis 17098 ---
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекНомерНедели) Тогда
		ТекНомерНедели = ТекНомерНедели - 1; 	//
		// rarus tenkam 14.01.2021 mantis 17098 +++
		//ПроверитьДанныеРегистра(ТекНомерНедели);
		ПроверитьДанныеРегистра(ТекНомерНедели, ТекГод);
		// rarus tenkam 14.01.2021 mantis 17098 ---
	КонецЕсли;	
	
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("НачалоПериода") Тогда
				// rarus tenkam 14.01.2021 mantis 17098 +++
				//ТекЭлемент.Значение = НачалоНедели(Дата(Год(ТекущаяДата()),1,1)+(ТекНомерНедели-1) * 604800);
				ТекЭлемент.Значение = НачалоНедели(Дата(ТекГод,1,1)+(ТекНомерНедели-1) * 604800);
				// rarus tenkam 14.01.2021 mantis 17098 ---
			КонецЕсли;
			
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("КонецПериода") Тогда
				// rarus tenkam 14.01.2021 mantis 17098 +++
				//ТекЭлемент.Значение = КонецНедели(Дата(Год(ТекущаяДата()),1,1)+(ТекНомерНедели-1) * 604800);
				ТекЭлемент.Значение = КонецНедели(Дата(ТекГод,1,1)+(ТекНомерНедели-1) * 604800);
				// rarus tenkam 14.01.2021 mantis 17098 ---
			КонецЕсли;
			
			// rarus tenkam 14.10.2019 mantis 14802 +++
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ДатаФормирования") Тогда
				ТекЭлемент.Значение = КонецДня(ТекущаяДата());	
			КонецЕсли;
			// rarus tenkam 14.10.2019 mantis 14802 ---
		КонецЕсли;
	КонецЦикла; 
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет"); 
	ОСКД = ОбъектОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	//НастройкиОСКД = ОСКД.НастройкиПоУмолчанию; 
	
		
	//ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы; 
	//
	//ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти(«НачалоПериода»); 
	//ЭлементНачалоПериода.Использование = Истина; 
	//ЭлементНачалоПериода.Значение = НачалоМесяца(ТекущаяДата()); 
	//
	//ЭлементКонецПериода = ПараметрыДанныхОСКД.Найти(«КонецПериода»); 
	//ЭлементКонецПериода.Использование = Истина; 
	//ЭлементКонецПериода.Значение = КонецМесяца(ТекущаяДата()); 
	//
	//ЭлементСчет = ПараметрыДанныхОСКД.Найти(«Счет»); 
	//ЭлементСчет.Использование = Истина; 
	//ЭлементСчет.Значение = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах; 
	
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОСКД)); 
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(ОСКД.НастройкиПоУмолчанию); 
	КомпоновщикНастроекДанных.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	
	НастройкиОСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();	
	
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных; 
	
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД);  
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет); 
	
	ТаблДок.Очистить(); 
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВыводаОСКД.УстановитьДокумент(ТаблДок); 
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД); 
	
КонецПроцедуры 

&НаКлиенте 
Процедура СформироватьОтчет(Команда) 
	//Если нет плановых данных на следующую неделю (они не были созданы РЗ), то создадим
		
	
	//Сформируем отчет
	СформироватьОтчетНаСервере(Результат); 
	// Чтобы не писалось «Отчет не сформирован…» 
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь; 
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьДанныеРегистра(НомерНедели, ТекГод)	// rarus tenkam 14.01.2021 mantis 17098 + (добавила ТекГод)
	НомерСледНедели = НомерНедели + 1;
	//ТекГод = Год(ТекущаяДата());	// rarus tenkam 14.01.2021 mantis 17098 +
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Scan_PlanForWeek.НомерНедели КАК НомерНедели
		|ИЗ
		|	РегистрСведений.Scan_PlanForWeek КАК Scan_PlanForWeek
		|ГДЕ
		|	Scan_PlanForWeek.НомерНедели = &НомерНедели
		|	И Scan_PlanForWeek.Год = &ТекущийГод";
	
	Запрос1.УстановитьПараметр("НомерНедели", НомерСледНедели);
	Запрос1.УстановитьПараметр("ТекущийГод", ТекГод);
	
	РезультатЗапроса = Запрос1.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    //rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		"ВЫБРАТЬ
		|	Scan_ЗаказыНаЗавод.Ссылка КАК ЗаказНаЗавод,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDDПоставщик,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDD2,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDD.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDD
		|ПОМЕСТИТЬ ЗаказыНаЗаводСКлючевымиДатами
		|ИЗ
		|	Справочник.Scan_ЗаказыНаЗавод КАК Scan_ЗаказыНаЗавод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|				,
		|				ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|					И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDDПоставщик)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик.Объект,
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|			,
		|			ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|				И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDD2)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2.Объект,
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|			,
		|			ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|				И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDD)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDD
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDD.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаЗаводСКлючевымиДатами.ЗаказНаЗавод КАК ЗаказНаЗавод
		|ПОМЕСТИТЬ ЗаказыНаЗаводДляОтбора
		|ИЗ
		|	ЗаказыНаЗаводСКлючевымиДатами КАК ЗаказыНаЗаводСКлючевымиДатами
		|ГДЕ
		|	ЗаказыНаЗаводСКлючевымиДатами.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		|	И ВЫБОР
		|			КОГДА ЗаказыНаЗаводСКлючевымиДатами.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		|			КОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		// rarus tenkam 27.04.2020 mantis 15947 +++
		//|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2
		|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		// rarus tenkam 27.04.2020 mantis 15947 ---
		|			ИНАЧЕ ЗаказыНаЗаводСКлючевымиДатами.CDD
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_Изделия.Ссылка) КАК SLA_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ SLA
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000075""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_Изделия.Ссылка) КАК MZ_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ MZ
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000065""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_Изделия.Ссылка) КАК MS_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ MS
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000154""
		|	И Scan_Изделия.ТипПродукта.ВидПродукта.Код = ""000000004""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_Изделия.Ссылка) КАК BusChassis_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ BusChassis
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	(Scan_Изделия.МестоПроизводства.Код = ""000000154""
		|			ИЛИ Scan_Изделия.МестоПроизводства.Код = ""000000078"")
		|	И Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000037""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Изделия.Ссылка КАК Buses_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ BusesВспомогательная
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	(Scan_Изделия.МестоПроизводства.Код = ""000000491""
		|			ИЛИ Scan_Изделия.МестоПроизводства.Код = ""000000358"")
		|	И (Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000037""
		|			ИЛИ Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000036""
		|			ИЛИ Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000001"")
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие,
		|	&НомерНедели
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000037""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000036""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000001"")
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.МестоПроизводства.Код = ""000000358""
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСклада.АдресДоставки)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСклада.Хранение))
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ BusesВспомогательная.Buses_План) КАК Buses_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ Buses
		|ИЗ
		|	BusesВспомогательная КАК BusesВспомогательная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие) КАК BodybuiltUnits_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ BodybuiltUnits
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродукта.ВидПродукта.Код = ""000000004""
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоОтгрузки.ЗарубежныйКузовостроитель = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие) КАК Jenty_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ Jenty
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Перевозчик.ГруппаJenty = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_КорректировкаИнформацииПоЗаявкам.Изделие) КАК TruckOnTruckDelivery_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ TruckOnTruckDelivery
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаДоставкиПлановая МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.Scan_СпособыДоставкиПродуктов.Автовозом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_КорректировкаИнформацииПоЗаявкам.Изделие) КАК JockeyTransportation_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ JockeyTransportation
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаДоставкиПлановая МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.Scan_СпособыДоставкиПродуктов.СвоимХодом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		// rarus tenkam 14.10.2019 mantis 14442 +++
		|	0 КАК GenSetsTransportation_План,
		//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие) КАК GenSetsTransportation_План,
		// rarus tenkam 14.10.2019 mantis 14442 ---
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ GenSetsTransportation
		// rarus tenkam 27.04.2020 mantis 15947 +++
		//|ИЗ
		//|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		//|ГДЕ
		//|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки = ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Исполнена)
		////|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродукта.ВидПродукта.ГруппаПродукта = ЗНАЧЕНИЕ(Справочник.Scan_ГруппыПродуктов.ДизельныеЭлектростанции)	// rarus tenkam 14.10.2019 mantis 14442 +
		// rarus tenkam 27.04.2020 mantis 15947 ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие КАК QuantityOfVehicles_План,
		|	&НомерНедели КАК НомерНедели
		|ПОМЕСТИТЬ QuantityOfVehiclesВспомогательная
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаПолучения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.КомпанияОтправитель.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА)
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК))
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.ВыездСотрудникаОЛ = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие,
		|	&НомерНедели
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
		|ГДЕ
		|	(Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу))
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И (Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Подрядчик.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Грузоотправитель.Кузовостроитель = ИСТИНА)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаВыкупа МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ВыездСотрудникаОЛ = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НомерНедели КАК НомерНедели,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ QuantityOfVehiclesВспомогательная.QuantityOfVehicles_План) КАК QuantityOfVehicles_План
		|ПОМЕСТИТЬ QuantityOfVehicles
		|ИЗ
		|	QuantityOfVehiclesВспомогательная КАК QuantityOfVehiclesВспомогательная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие КАК QuantityOfVisits_План,
		|	&НомерНедели КАК НомерНедели,
		|	ВЫБОР
		|		КОГДА Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Подрядчик = ЗНАЧЕНИЕ(Справочник.Scan_Контрагенты.ПустаяСсылка)
		|			ТОГДА Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Грузоотправитель
		|		ИНАЧЕ Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Подрядчик
		|	КОНЕЦ КАК Кузовостроитель,
		|	НАЧАЛОПЕРИОДА(Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаПолучения, ДЕНЬ) КАК ДатаПолучения
		|ПОМЕСТИТЬ QuantityOfVisitsВспомогательная
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	(Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Грузоотправитель.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаПолучения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И (Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК)
		|			ИЛИ Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК))
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ВыездСотрудникаОЛ = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействие.Ссылка,
		|	&НомерНедели,
		|	ВЫБОР
		|		КОГДА Scan_ЗаявкаНаДействие.Подрядчик = ЗНАЧЕНИЕ(Справочник.Scan_Контрагенты.ПустаяСсылка)
		|			ТОГДА Scan_ЗаявкаНаДействие.Грузоотправитель
		|		ИНАЧЕ Scan_ЗаявкаНаДействие.Подрядчик
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(Scan_ЗаявкаНаДействие.ДатаВыкупа, ДЕНЬ)
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие КАК Scan_ЗаявкаНаДействие
		|ГДЕ
		|	(Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение)
		|			ИЛИ Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу))
		|	И Scan_ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И (Scan_ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_ЗаявкаНаДействие.Грузоотправитель.Кузовостроитель = ИСТИНА)
		|	И Scan_ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаНаДействие.ДатаВыкупа МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаНаДействие.ВыездСотрудникаОЛ = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НомерНедели КАК НомерНедели,
		|	МАКСИМУМ(QuantityOfVisitsВспомогательная.QuantityOfVisits_План) КАК QuantityOfVisits_План,
		|	QuantityOfVisitsВспомогательная.Кузовостроитель КАК Кузовостроитель,
		|	QuantityOfVisitsВспомогательная.ДатаПолучения КАК ДатаПолучения
		|ПОМЕСТИТЬ QuantityOfVisitsВспомогательная2
		|ИЗ
		|	QuantityOfVisitsВспомогательная КАК QuantityOfVisitsВспомогательная
		|
		|СГРУППИРОВАТЬ ПО
		|	QuantityOfVisitsВспомогательная.Кузовостроитель,
		|	QuantityOfVisitsВспомогательная.ДатаПолучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НомерНедели КАК НомерНедели,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ QuantityOfVisitsВспомогательная2.QuantityOfVisits_План) КАК QuantityOfVisits_План
		|ПОМЕСТИТЬ QuantityOfVisits
		|ИЗ
		|	QuantityOfVisitsВспомогательная2 КАК QuantityOfVisitsВспомогательная2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие) КАК AcceptanceHandoverDemoTestRent_План2,
		|	&НомерНедели КАК НомерНедели,
		|	0 КАК AcceptanceHandoverDemoTestRent_План
		|ПОМЕСТИТЬ AcceptanceHandoverDemoTestRent
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.аннулирована)
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Аренда = ИСТИНА
		//Rarus bonmak 16.05.2022 19158 ++
		//|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ДемоИТест = ИСТИНА)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Демо = ИСТИНА
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Тест = ИСТИНА)
		//Rarus bonmak 16.05.2022 19158 --
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаУходаФакт <> ДАТАВРЕМЯ(1, 1, 1)
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.Код = ""000000219""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоОтгрузки.Код = ""000000219"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НомерНедели КАК НомерНедели,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие) КАК AdministrationOfVehiclesSales_План
		|ПОМЕСТИТЬ AdministrationOfVehiclesSales
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
		|ГДЕ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.аннулирована)
		|	И (Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК))
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаПродажи <> ДАТАВРЕМЯ(1, 1, 1)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаПродажи МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	SLA.SLA_План КАК SLA,
		|	MZ.MZ_План КАК MZ,
		|	MS.MS_План КАК MS,
		|	BusChassis.BusChassis_План КАК BusChassis,
		|	Buses.Buses_План КАК Buses,
		|	BodybuiltUnits.BodybuiltUnits_План КАК BodybuiltUnits,
		|	Jenty.Jenty_План КАК Jenty,
		|	JockeyTransportation.JockeyTransportation_План КАК JockeyTransportation,
		|	GenSetsTransportation.GenSetsTransportation_План КАК GenSetsTransportation,
		|	TruckOnTruckDelivery.TruckOnTruckDelivery_План КАК TruckOnTruckDelivery,
		|	QuantityOfVehicles.QuantityOfVehicles_План КАК QuantityOfVehicles,
		|	QuantityOfVisits.QuantityOfVisits_План КАК QuantityOfVisits,
		|	AdministrationOfVehiclesSales.AdministrationOfVehiclesSales_План КАК AdministrationOfVehiclesSales,
		|	AcceptanceHandoverDemoTestRent.AcceptanceHandoverDemoTestRent_План2 КАК AcceptanceHandoverDemoTestRent
		|ИЗ
		|	SLA КАК SLA,
		|	MZ КАК MZ,
		|	MS КАК MS,
		|	BusChassis КАК BusChassis,
		|	BodybuiltUnits КАК BodybuiltUnits,
		|	Jenty КАК Jenty,
		|	TruckOnTruckDelivery КАК TruckOnTruckDelivery,
		|	JockeyTransportation КАК JockeyTransportation,
		|	GenSetsTransportation КАК GenSetsTransportation,
		|	QuantityOfVehicles КАК QuantityOfVehicles,
		|	QuantityOfVisits КАК QuantityOfVisits,
		|	AcceptanceHandoverDemoTestRent КАК AcceptanceHandoverDemoTestRent,
		|	AdministrationOfVehiclesSales КАК AdministrationOfVehiclesSales,
		|	Buses КАК Buses";
	
	КонецПериода = КонецНедели(Дата(ТекГод,1,1)+(НомерСледНедели-1) * 604800);
	НачалоПериода = НачалоНедели(Дата(ТекГод,1,1)+(НомерСледНедели-1) * 604800);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НомерНедели", НомерСледНедели +1 );
	Запрос.УстановитьПараметр("ТекущийГод", ТекГод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.Scan_PlanForWeek.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Год.Установить(ТекГод);
		НаборЗаписей.Прочитать();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		НоваяЗапись.Год = ТекГод;
		НоваяЗапись.НомерНедели = НомерСледНедели;
		НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		НоваяЗапись.ДатаИзменения = ТекущаяДата();
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
	// Запишем детальные записи
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    //rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		"ВЫБРАТЬ
		|	Scan_ЗаказыНаЗавод.Ссылка КАК ЗаказНаЗавод,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDDПоставщик,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDD2,
		|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследнихCDD.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК CDD
		|ПОМЕСТИТЬ ЗаказыНаЗаводСКлючевымиДатами
		|ИЗ
		|	Справочник.Scan_ЗаказыНаЗавод КАК Scan_ЗаказыНаЗавод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|				,
		|				ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|					И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDDПоставщик)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDDПоставщик.Объект,
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|			,
		|			ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|				И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDD2)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDD2.Объект,
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
		|			,
		|			ОбъектКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод)
		|				И ВидКлючевойДаты = ЗНАЧЕНИЕ(Перечисление.Scan_КлючевыеДаты.CDD)) КАК Scan_КлючевыеДатыПроцессовСрезПоследнихCDD
		|		ПО Scan_ЗаказыНаЗавод.Ссылка = Scan_КлючевыеДатыПроцессовСрезПоследнихCDD.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаЗаводСКлючевымиДатами.ЗаказНаЗавод КАК ЗаказНаЗавод
		|ПОМЕСТИТЬ ЗаказыНаЗаводДляОтбора
		|ИЗ
		|	ЗаказыНаЗаводСКлючевымиДатами КАК ЗаказыНаЗаводСКлючевымиДатами
		|ГДЕ
		|	ЗаказыНаЗаводСКлючевымиДатами.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		|	И ВЫБОР
		|			КОГДА ЗаказыНаЗаводСКлючевымиДатами.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		|			КОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		// rarus tenkam 27.04.2020 mantis 15947 +++
		//|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2
		|				ТОГДА ЗаказыНаЗаводСКлючевымиДатами.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		// rarus tenkam 27.04.2020 mantis 15947 ---
		|			ИНАЧЕ ЗаказыНаЗаводСКлючевымиДатами.CDD
		|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		
		|ВЫБРАТЬ
		|	Scan_Изделия.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ SLA
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000075""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Изделия.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ MZ
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000065""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Изделия.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ MS
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.МестоПроизводства.Код = ""000000154""
		|	И Scan_Изделия.ТипПродукта.ВидПродукта.Код = ""000000004""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Изделия.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ BusChassis
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	(Scan_Изделия.МестоПроизводства.Код = ""000000154""
		|			ИЛИ Scan_Изделия.МестоПроизводства.Код = ""000000078"")
		|	И Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000037""
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр. 
		|	И Scan_Изделия.ЗаказНаЗавод В (ВЫБРАТЬ ЗаказНаЗавод ИЗ ЗаказыНаЗаводДляОтбора)
		//|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	NULL КАК Значение
		//|ПОМЕСТИТЬ Engines
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Изделия.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ Buses
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	(Scan_Изделия.МестоПроизводства.Код = ""000000491""
		|			ИЛИ Scan_Изделия.МестоПроизводства.Код = ""000000358"")
		//rarus BProg_Gladkov 21.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		|	И Scan_Изделия.ЗаказНаЗавод.КодАдресаДоставки = ЗНАЧЕНИЕ(Справочник.Scan_КодыАдресовДоставки.PORTSTP)
		//|	И ВЫБОР
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDDПоставщик МЕЖДУ &НачалоПериода И &КонецПериода
		//|			КОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 <> ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА Scan_Изделия.ЗаказНаЗавод.CDD2 МЕЖДУ &НачалоПериода И &КонецПериода
		//|			ИНАЧЕ Scan_Изделия.ЗаказНаЗавод.CDD МЕЖДУ &НачалоПериода И &КонецПериода
		//|		КОНЕЦ
		//rarus BProg_Gladkov 21.11.2019 0014452 -- 
		|	И (Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000037""
		|			ИЛИ Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000036""
		|			ИЛИ Scan_Изделия.ТипПродуктаЛогистический.Код = ""000000001"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000037""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000036""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродуктаЛогистический.Код = ""000000001"")
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.МестоПроизводства.Код = ""000000358""
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСклада.АдресДоставки)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.ТипСклада = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСклада.Хранение))
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ BodybuiltUnits
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродукта.ВидПродукта.Код = ""000000004""
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоОтгрузки.ЗарубежныйКузовостроитель = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ Jenty
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Перевозчик.ГруппаJenty = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_КорректировкаИнформацииПоЗаявкам.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ TruckOnTruckDelivery
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаДоставкиПлановая МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.Scan_СпособыДоставкиПродуктов.Автовозом)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_КорректировкаИнформацииПоЗаявкам.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ JockeyTransportation
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаДоставкиПлановая МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.Scan_СпособыДоставкиПродуктов.СвоимХодом)
		|;
		| 		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		// rarus tenkam 14.10.2019 mantis 14442 +++
		//|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия КАК Значение
		|	NULL КАК Значение
		// rarus tenkam 14.10.2019 mantis 14442 ---
		//|ПОМЕСТИТЬ GenSetsTransportation
		// rarus tenkam 27.04.2020 mantis 15947 +++
		//|ИЗ
		//|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		//|ГДЕ
		//|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		//|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки = ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Исполнена)
		////|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ТипПродукта.ВидПродукта.ГруппаПродукта = ЗНАЧЕНИЕ(Справочник.Scan_ГруппыПродуктов.ДизельныеЭлектростанции)		// rarus tenkam 14.10.2019 mantis 14442 +
		// rarus tenkam 27.04.2020 mantis 15947 ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ QuantityOfVehicles
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаПолучения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.КомпанияОтправитель.Кузовостроитель = ИСТИНА ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК))
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие.НомерИзделия
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
		|ГДЕ
		|	(Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу))
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И (Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Подрядчик.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Грузоотправитель.Кузовостроитель = ИСТИНА)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаВыкупа МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		| 		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие КАК Значение
		//|ПОМЕСТИТЬ QuantityOfVisits
		|ИЗ
		|	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
		|ГДЕ
		|	(Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Грузоотправитель.Кузовостроитель = ИСТИНА ИЛИ Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА)
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ДатаПолучения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И (Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК)
		|			ИЛИ Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК))
		|	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие.ВыездСотрудникаОЛ = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействие.Ссылка
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие КАК Scan_ЗаявкаНаДействие
		|ГДЕ
		|	(Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение)
		|			ИЛИ Scan_ЗаявкаНаДействие.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу))
		|	И Scan_ЗаявкаНаДействие.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействие.Проведен = ИСТИНА
		|	И (Scan_ЗаявкаНаДействие.Подрядчик.Кузовостроитель = ИСТИНА
		|			ИЛИ Scan_ЗаявкаНаДействие.Грузоотправитель.Кузовостроитель = ИСТИНА)
		|	И Scan_ЗаявкаНаДействие.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаНаДействие.ДатаВыкупа МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаНаДействие.ВыездСотрудникаОЛ = ИСТИНА
		|;
		|  		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ AcceptanceHandoverDemoTestRent
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.аннулирована)
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Аренда = ИСТИНА
		//Rarus bonmak 16.05.2022 19158 ++
		//|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.ДемоИТест = ИСТИНА)
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Демо = ИСТИНА
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие.Тест = ИСТИНА)
		//Rarus bonmak 16.05.2022 19158 --
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ДатаУходаФакт <> ДАТАВРЕМЯ(1, 1, 1)
		|	И (Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоДоставки.Код = ""000000219""
		|			ИЛИ Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.МестоОтгрузки.Код = ""000000219"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие.НомерИзделия КАК Значение
		//|ПОМЕСТИТЬ AdministrationOfVehiclesSales
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
		|ГДЕ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Проведен = ИСТИНА
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.аннулирована)
		|	И (Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК))
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаПродажи <> ДАТАВРЕМЯ(1, 1, 1)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ДатаПродажи МЕЖДУ &НачалоПериода И &КонецПериода";
	
	КонецПериода = КонецНедели(Дата(ТекГод,1,1)+(НомерСледНедели-1) * 604800);
	НачалоПериода = НачалоНедели(Дата(ТекГод,1,1)+(НомерСледНедели-1) * 604800);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НомерНедели", НомерСледНедели +1 );
	Запрос.УстановитьПараметр("ТекущийГод", ТекГод);
	
	РезультатПакеты = Запрос.ВыполнитьПакет();
	//rarus BProg_Gladkov 21.11.2019 0014452 ++ Увеличил номера пакетов в запросе на 2 (добавлены две верменные таблицы в начале запроса
	ТаблицаSLA = РезультатПакеты[2].Выгрузить();
	ТаблицаMZ = РезультатПакеты[3].Выгрузить();
	ТаблицаMS = РезультатПакеты[4].Выгрузить();
	ТаблицаBusChassis = РезультатПакеты[5].Выгрузить();
	ТаблицаEngines = РезультатПакеты[6].Выгрузить();
	ТаблицаBuses = РезультатПакеты[7].Выгрузить();
	ТаблицаBodybuiltUnits = РезультатПакеты[8].Выгрузить();
	ТаблицаJenty = РезультатПакеты[9].Выгрузить();
	ТаблицаTruckOnTruckDelivery = РезультатПакеты[10].Выгрузить();
	ТаблицаJockeyTransportation = РезультатПакеты[11].Выгрузить();
	ТаблицаGenSetsTransportation = РезультатПакеты[12].Выгрузить();
	ТаблицаQuantityOfVehicles = РезультатПакеты[13].Выгрузить();
	ТаблицаQuantityOfVisits = РезультатПакеты[14].Выгрузить();
	ТаблицаAcceptanceHandoverDemoTestRent = РезультатПакеты[15].Выгрузить();
	ТаблицаAdministrationOfVehiclesSales  = РезультатПакеты[16].Выгрузить();
	//rarus BProg_Gladkov 21.11.2019 0014452 -- 
	
	SLAплан = Новый ХранилищеЗначения(ТаблицаSLA, Новый СжатиеДанных(9));	
	
	НаборЗаписей = РегистрыСведений.Scan_ДетализацияПлановыхДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерНедели.Установить(НомерСледНедели);
	НаборЗаписей.Отбор.Год.Установить(ТекГод);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.SLA = Новый ХранилищеЗначения(ТаблицаSLA, Новый СжатиеДанных(9));	
	НоваяЗапись.MZ = Новый ХранилищеЗначения(ТаблицаMZ, Новый СжатиеДанных(9));	
	НоваяЗапись.MS = Новый ХранилищеЗначения(ТаблицаMS, Новый СжатиеДанных(9));	
	НоваяЗапись.BusChassis = Новый ХранилищеЗначения(ТаблицаBusChassis, Новый СжатиеДанных(9));	
	НоваяЗапись.Engines = Новый ХранилищеЗначения(ТаблицаEngines, Новый СжатиеДанных(9));	
	НоваяЗапись.Buses = Новый ХранилищеЗначения(ТаблицаBuses, Новый СжатиеДанных(9));	
	НоваяЗапись.BodybuiltUnits = Новый ХранилищеЗначения(ТаблицаBodybuiltUnits, Новый СжатиеДанных(9));	
	НоваяЗапись.Jenty = Новый ХранилищеЗначения(ТаблицаJenty, Новый СжатиеДанных(9));	
	НоваяЗапись.TruckOnTruckDelivery = Новый ХранилищеЗначения(ТаблицаTruckOnTruckDelivery, Новый СжатиеДанных(9));	
	НоваяЗапись.JockeyTransportation = Новый ХранилищеЗначения(ТаблицаJockeyTransportation, Новый СжатиеДанных(9));	
	НоваяЗапись.GenSetsTransportation = Новый ХранилищеЗначения(ТаблицаGenSetsTransportation, Новый СжатиеДанных(9));	
	НоваяЗапись.QuantityOfVehicles = Новый ХранилищеЗначения(ТаблицаQuantityOfVehicles, Новый СжатиеДанных(9));	
	НоваяЗапись.QuantityOfVisits = Новый ХранилищеЗначения(ТаблицаQuantityOfVisits, Новый СжатиеДанных(9));	
	НоваяЗапись.AcceptanceHandoverDemoTestRent = Новый ХранилищеЗначения(ТаблицаAcceptanceHandoverDemoTestRent, Новый СжатиеДанных(9));	
	НоваяЗапись.AdministrationOfVehiclesSales = Новый ХранилищеЗначения(ТаблицаAdministrationOfVehiclesSales, Новый СжатиеДанных(9));	
	
	НоваяЗапись.Год = ТекГод;
	НоваяЗапись.НомерНедели = НомерСледНедели;
	НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	НоваяЗапись.ДатаИзменения = ТекущаяДата();
	
	НаборЗаписей.Записать();      
	
	
КонецПроцедуры
//rarus tenkam 28.12.2017 mantis 9066 ---
